{
  "Title": "Demons of the Deep (Book 19)",
  "Map": {
    "0": {
      "Id": 0,
      "Description": "You are a doughty sailor, a rover of the seven seas. You have many years' experience as a mariner, on great ships and small, on sailing-boats and huge warships. Neither howling storm nor dead calm disturbs you. Your trusty cutlass has slain many brigands and strange creatures of the deep. In port, you keep your listeners enthralled with your sea-stories. Some are true, some aren't... but nobody knows the difference except you.<br> You are five days out of Port Blacksand, first mate on the good ship <i>Sunfish</i>, when the pirate ship strikes. Swooping in on black sails like the wings of some giant, predatory sea-bird, it rams its prow across your decks. Beneath a leering, sharp-toothed figurehead is her name - the <i>Troll</i>. Dozens of ragged pirates swarm across the rails and attack.<br> The crew of the <i>Sunfish</i> fights bravely, but a peaceful merchant ship is no match for a pirate vessel. One by one you see your comrades fall. At last, only you are left. With your back to the mainmast, you lay about you with your trusty sabre, wounding one pirate after another. The pirates back away from you in fear. You drop your guard for a second - but too soon! From behind you, a black-bearded ruffian swings a huge belaying-pin. You see stars... then nothing.<br> When you awake, you are surprised to find yourself still alive. The <i>Sunfish</i>, a battered wreck, is burning nearby. Your comrades' bodies are gone - consigned, no doubt, to the deeps. You are on the deck of the <i>Troll</i>. Its sails snap in the breeze as the pirates head for their island lair.<br> You try to stand... and find you are tied to the mast. A coarse laugh comes from behind you. 'So... our hero is awake!' The speaker steps into view, and you see your captor - a bald, burly man in a once-elegant purple coat; he sweeps a mocking bow. 'Captain Bloodaxe, at your service! A pleasure to meet such a valiant fighter! I would offer you a place in my crew, but somehow you don't seem quite our type. Whatever shall we do with you?'<br> Several of the jeering pirates begin to offer suggestions: 'Keelhaul him! Run him up the mainmast and use him for a flag! Troll for sharks, with him as the bait!' But Captain Bloodaxe waves them to silence: 'No, my hearties! How savage of you! You should be ashamed of yourselves.' This one stood alone and defied us, slaying many of our comrades. Such a worthy fighter must be rewarded fittingly and will leave the ship unharmed!'<br> The pirates grumble, but the captain shouts them down, 'First, we must return your good sword to you.' He picks it up from the deck and replaces it in the scabbard at your belt.<br> 'Second, we must give you provisions for your trip.' He snaps his fingers, and a pirate brings a bag of black bread and salt beef - enough provisions for ten meals. He ties a heavy bag to your belt.<br> 'Third, we mush release these cruel bonds.' He draws his dirk and slashes the ropes that hold you to the mast. He yanks you to your feet, your hands still tied behind you. 'You'll forgive me if I don't untie your hands just yet, but you're a very dangerous foe!' Behind him, the pirates snicker.<br> 'And finally, we must give you your freedom!' He escorts you to the stern of the ship, where the lifeboats are tied. The pirate crew follows, grumbling. 'Unfortunately,' he adds, 'we can't spare a boat. So you'll just have to <i>swim</i> home!' With a powerful shove, he sends you over the railing. You hit the water with a tremendous splash. As Captain Bloodaxes's gifts drag you underwater, you hear the pirate crew laughing at the joke...",
      "Choices": [
        {
          "Description": "Start your adventure...",
          "Id": 1
        }
      ]
    },
    "1": {
      "Id": 1,
      "Description": "You sink slowly beneath the surface, holding your breath. Desperately, you try to free your hands, but the bonds are tight. Deeper and deeper you sink. Curious fish circle around you, and the world slowly turns sea-green. The ocean is shallow here, and you see that you are descending towards tall spires or coral. No, not coral, but a sunken city! You are drifting into the middle of a stately courtyard, now overgrown with weeds and coral. As your feet touch the bottom, you see lines of light blaze all around you. You gasp - losing most of your breath in a great bubble. The whole courtyard is a giant magical pentagram, and you are standing in its centre!<br> You have no time to appreciate the magic, however: you must swim back to the surface or drown! But the weight at your belt holds you down, and you cannot untie your hands. At last your strength fails, and you inhale the cold water. But you remain unharmed!<br> You realise that the magic of the pentagram has somehow protected you from drowning. You kick your way to a sharp coral spire and rub the rope against it until your hands are free. A strange feeling at your throat prompts you to look at your reflection in your shining sword. The spell has given you gills! You can breathe under water just like a Merman. You find that your leather bag of ten provisions is intact. Evidently the spell is also keeping the food from being ruined by the sea-water.",
      "Choices": [
        {
          "Description": "Remove the heavy belt and swim to the surface.",
          "Id": 63
        },
        {
          "Description": "Explore the sunken courtyard.",
          "Id": 173
        }
      ]
    },
    "2": {
      "Id": 2,
      "Description": "The underwater gardens seem to be laid out just like a formal garden on land. You swim through the heavy iron gate, noting that it is not at all rusty. Inside the gate, you see many beautiful specimens of seaweed, coral and water plants. Instead of birds, the 'trees' are filled with coloured fish. It is eerie, but peaceful. A few yards from the gate, the path splits in two.",
      "Choices": [
        {
          "Description": "Go to the left.",
          "id": 359
        },
        {
          "Description": "Go to the right.",
          "id": 174
        }
      ]
    },
    "3": {
      "Id": 3,
      "Description": "You swim strongly up and away from the stadium, through the crack in the dome and over the city once more. Not far away, you see the patch of clean sand that you observed earlier. You can now see that a small object of some kind is in the middle of the sand.",
      "Choices": [
        {
          "Description": "Continue...",
          "Id": 196
        }
      ]
    },
    "4": {
      "Id": 4,
      "Description": "The king's eyes open even wider. 'Yes, since you ask, there is a great service you can do for our kingdom. In an upper room of our palace lies a fair princess, doomed to sleep until she be kissed by a hero. None of our nobles has been able to lift the spell. Will you try?",
      "Choices": [
        {
          "Description": "Agree to try.",
          "Id": 399
        },
        {
          "Description": "Decline the honour.",
          "Id": 284
        }
      ]
    },
    "5": {
      "Id": 5,
      "Description": "Her evil appearance chills your blood, but perhaps she can be helpful to you. Keeping your hand well away from your sword, you speak to her as courteously as you can. 'O wise woman, pray forgive my intrusion, but I am in need of help. I have brought you a valuable gift, and you would honour me by accepting it.' She thrusts out her hand greedily. What will you offer her?",
      "Choices": [
        {
          "Description": "A Black Pearl.",
          "Id": 127,
          "RequiredItemId": 1
        },
        {
          "Description": "A Toothfish.",
          "Id": 127,
          "RequiredItemId": 2
        },
        {
          "Description": "A magic sword.",
          "Id": 127,
          "RequiredItemId": 3
        },
        {
          "Description": "Attack her.",
          "Id": 254
        }
      ]
    },
    "6": {
      "Id": 6,
      "Description": "You swim down into the chasm. The light fails rapidly as you swim lower.",
      "Choices": [
        {
          "Description": "Continue...",
          "Id": 324,
          "DefaultIfItemIdPossessed": 4
        },
        {
          "Description": "Continue...",
          "Id": 180
        }
      ]
    },
    "7": {
      "Id": 7,
      "Description": "You doubt that you could flee from the creature, and you are certainly not anxious to fight it. Your only hope is to talk to it. What will you appeal to in your speech?",
      "Choices": [
        {
          "Description": "Its good will.",
          "Id": 334
        },
        {
          "Description": "Its greed.",
          "Id": 178
        },
        {
          "Description": "Its hatred of pirates.",
          "Id": 287
        }
      ]
    },
    "8": {
      "Id": 8,
      "Description": "You hear a rustling behind you. You kick off from the bottom and spin around, your sword at the ready. Then, from all sides at once, the small Crabs attack.",
      "Choices": [
        {
          "Description": "Stand and fight them.",
          "Id": 169
        },
        {
          "Description": "Flee.",
          "Id": 118
        }
      ]
    },
    "9": {
      "Id": 9,
      "Description": "The Sea-horse swims madly in circles, bucking and tossing, but you keep your seat. Eventually it quietens, but still rolls its eyes. You pat ts nose reassuringly. You find that you can guide it with your knees, and that it swims much faster than you do. You direct it towards the cathedral in the distance. When you reach your goal, you dismount, and the Sea-horse swims away.",
      "LuckChange": 2,
      "Choices": [
        {
          "Description": "Continue...",
          "Id": 269
        }
      ]
    },
    "10": {
      "Id": 10,
      "Description": "You swim away as fast as you can, leaving the sinister skull behind you. When you risk a look over your shoulder, you see that the shimmering has vanished and everything is as it was before. You swim towards the large stone building.",
      "Choices": [
        {
          "Description": "Continue...",
          "Id": 159
        }
      ]
    },
    "11": {
      "Id": 11,
      "Description": "You swim up until your head is level with the statue's, and you lift the crown from its stony brow. As you do so, its eyes turn towards you and its lips move. It speaks, in a voice so deep you can feel your bones vibrate: 'Who dares take the Crown of Atlantis from its resting-place? Will you fight for your prize or flee like a coward?'",
      "Choices": [
        {
          "Description": "Fight the Statue.",
          "Id": 232
        },
        {
          "Description": "Flee like a coward.",
          "Id": 39
        },
        {
          "Description": "Return the crown.",
          "Id": 0
        }
      ]
    },
    "12": {
      "Id": 12,
      "Description": "The trapdoor slams shut behind you as you whirl in the current. You catch hold of something to steady yourself. You are in pitch-blackness.",
      "Choices": [
        {
          "Description": "Continue...",
          "Id": 258,
          "DefaultIfItemIdPossessed": 4
        },
        {
          "Description": "Continue...",
          "Id": 113
        }
      ]
    },
    "13": {
      "Id": 13,
      "Description": "You fight the four Batfish. They dart around, swooping in to bite, so you can battle them one at a time:",
      "CanEscape": false,
      "Success": 390,
      "Antagonists": [
        {
          "Description": "Batfish",
          "Skill": 6,
          "Stamina": 4
        },
        {
          "Description": "Batfish",
          "Skill": 6,
          "Stamina": 4
        },
        {
          "Description": "Batfish",
          "Skill": 6,
          "Stamina": 4
        },
        {
          "Description": "Batfish",
          "Skill": 6,
          "Stamina": 4
        }
      ]
    },
    "14": {
      "Id": 14,
      "Description": "You reach into your bag and find the bottle with the envelope. He is amazed, but immediately opens the bottle and reads the message. It is obviously important; he hems and haws, puts it in a pocket of his robe and thanks you gruffily. For the first time, he seems to notice your bedraggled condition. He snaps his fingers and restores your <c>Stamina</c> and <c>Luck</c> to their initial values!",
      "RestoreStamina": true,
      "RestoreLuck": true, 
      "Choices": [
        {
          "Description": "Continue...",
          "Id": 376
        }
      ]
    },
    "15": {
      "Id": 15,
      "Description": "The Water Elemental begs your pardon for threatening you. 'You did me no wrong,' it says. 'But I have been held prisoner here these many years, and did unjustly loose my wrath upon you. My thanks for staying your hand when you might have slain me. The current wafts you back through the coral tunnel so cleverly that you are not scraped at all.'",
      "LuckChange": 2,
      "Choices": [
        {
          "Description": "Continue...",
          "Id": 197
        }
      ]
    },
    "16": {
      "Id": 16,
      "Description": "You swim away from the building, over the courtyard with the pentagram, and over the city of Atlantis. You find that swimming is coming very naturally to you now. Looking down over the city, you see no movement except for fish. The buildings appear deserted. Some have fallen into rubble and most are damaged, but the effect is still one of peace and beauty. Three spots catch your eye, and you must decide which one to visit.",
      "Choices": [
        {
          "Description": "A huge red-coloured dome with a broken roof.",
          "Id": 223
        },
        {
          "Description": "An unnaturally clear, smooth patch of sand.",
          "Id": 196
        },
        {
          "Description": "A square stone building, very well preserved.",
          "Id": 340
        }
      ]
    },
    "17": {
      "Id": 17,
      "Description": "You dive for the trapdoor, but you cannot get it open in time. The Bone Demon's spear jabs you.",
      "StaminaChange": -2,
      "Choices": [
        {
          "Description": "Fight the demon.",
          "Id": 168
        }
      ]
    },
    "18": {
      "Id": 18,
      "Description": "You remove the Axefish from your bag and release it. It quickly grows into a large fish with a heavy beak. It swims towards the bars, attacks them and batters them to pieces. It then swims away, its duty done. As you hurry from the cave, the current carries you downstream along the abyss.",
      "Choices": [
        {
          "Description": "Continue...",
          "Id": 148
        }
      ],
      "Items": [ 5 ]
    },
    "19": {
      "Id": 19,
      "Description": "Before your hand reaches the chest, one of the pink tentacles drifts down across your wrist. It burns like fire! What will you do now?",
      "StaminaChange": -1,
      "Choices": [
        {
          "Description": "Leave the house.",
          "Id": 381
        },
        {
          "Description": "Drag the chest out with your sword.",
          "Id": 325
        },
        {
          "Description": "Attack the Anemones.",
          "Id": 94
        }
      ]
    },
    "20": {
      "Id": 20,
      "Description": "You enter a part of the garden that looks rather like an orchard. Tall branches of coral support vine-like plants bearing red and orange fruit. On the sandy floor of the garden, small crabs and fish are picking at a fallen fruit.",
      "Choices": [
        {
          "Description": "Sample a fruit.",
          "Id": 124
        },
        {
          "Description": "Continue...",
          "Id": 234
        }
      ]
    },
    "21": {
      "Id": 21,
      "Description": "You pick up the trident and heft it. It vibrates in your hand. Suddenly it shoots forward, dragging you with it. You try to let go, but your fingers are stuck as though with glue. You are carried along quickly, and your surprised shout sends bubbles towards the ceiling. As you pass through their quarters, other Mermen and Mermaids stare at you in surprise. Then you are outside the cavern, speeding through the green waters. You have lost track of your location, but you know you are being carried further and further from the surface. TODO"
    },
    "22": {
      "Id": 22,
      "Description": "You pay Cyrano...TODO"
    },
    "23": {
      "Id": 23,
      "Description": "As you swim away from the mausoleum, you spy a large, sleek Dolphin. It has already seen you and is swimming in your direction. What will you do?",
      "Choices": [
        {
          "Description": "Flee.",
          "Id": 259
        },
        {
          "Description": "Speak to it.",
          "Id": 198
        },
        {
          "Description": "Attack it.",
          "Id": 387
        }
      ]
    },
    "24": {
      "Id": 24,
      "Description": "You enter the sunken ship. In the sudden dimness, you can barely see where you are going. You grab the side of a door and try to feel your way. TODO"
    },
    "25": {
      "Id": 25,
      "Description": "The Merman looks up in surprise as you dart through his door. When he sees your drawn sword, his eyes open even wider. He throws his Sawfish at you and picks up a long knife - a Knifefish! - from his bench. The Sawfish grows larger and attacks you. You must fight it, and then the Merman. TODO"
    },
    "196": {
      "Id": 196,
      "Description": "You swim closer, until you see a large area of clean white sand. Standing upright in the sand is a moss-covered human skull. As you approach, the water around the skull begins to shimmer and you hear a thin voice inside your head. What will you do?",
      "Choices": [
        {
          "Description": "Run away.",
          "Id": 10
        },
        {
          "Description": "Listen to the voice.",
          "Id": 321
        },
        {
          "Description": "Attack.",
          "Id": 26
        }
      ]
    }
  },
  "Items": [
    {
      "Id": 1,
      "Description": "Black Pearl"
    },
    {
      "Id": 2,
      "Description": "Toothfish"
    },
    {
      "Id": 3,
      "Description": "Magic Sword"
    },
    {
      "Id": 4,
      "Description": "Glowfish"
    },
    {
      "Id": 5,
      "Description": "Ordinary Sword" 
    }
  ],
  "Resources": {
    "luck-up": "Your <i>luck</i> has increased by <i>{0} point{s}</i>.",
    "luck-down": "You <i>luck</i> has decreased by <i>{0} point{s}</i>.",
    "stamina-up": "Your <i>stamina</i> has increased by <i>{0} point{s}</i>.",
    "stamina-down": "You <i>stamina</i> has decreased by <i>{0} point{s}</i>."
  } 
}