{
  "Title": "Demons of the Deep",
  "Map": {
    "0": {
      "Id": 0,
      "Description": "You are a doughty sailor, a rover of the seven seas. You have many years' experience as a mariner, on great ships and small, on sailing-boats and huge warships. Neither howling storm nor dead calm disturbs you. Your trusty cutlass has slain many brigands and strange creatures of the deep. In port, you keep your listeners enthralled with your sea-stories. Some are true, some aren't... but nobody knows the difference except you.<br> You are five days out of Port Blacksand, first mate on the good ship <i>Sunfish</i>, when the pirate ship strikes. Swooping in on black sails like the wings of some giant, predatory sea-bird, it rams its prow across your decks. Beneath a leering, sharp-toothed figurehead is her name - the Troll. Dozens of ragged pirates swarm across the rails and attack.<br> The crew of the <i>Sunfish</i> fights bravely, but a peacful merchant ship is no match for a pirate vessel. One by one you see your comrades fall. At last, only you are left. With your back to the mainmast, you lay about you with your trusty sabre, wounding one pirate after another. The pirates back away from you in fear. You drop your guard for a second - but too soon! From behind you, a black-bearded ruffian swings a huge belaying-pin. You see stars... then nothing."
    },
    "3": {
      "Id": 3,
      "Description": "You swim strongly up and away from the stadium, through the crack in the dome and over the city once more. Not far away, you see the patch of clean sand that you observe earlier. You can now see that a small object of some kind is in the middle of the sand.",
      "Choices": [
        {
          "Description": "Continue...",
          "Id": 196
        }
      ]
    },
    "196": {
      "Id": 196,
      "Description": "You swim closer, until you see a large area of clean white sand. Standing upright in the sand is a moss-covered human skull. As you approach, the water around the skull begins to shimmer and you hear a thin voice inside your head. What will you do?",
      "Choices": [
        {
          "Description": "Run away.",
          "Id": 10
        },
        {
          "Description": "Listen to the voice.",
          "Id": 321
        },
        {
          "Description": "Attack.",
          "Id": 26
        }
      ]
    }
  }
}