{
  "Title": "Demons of the Deep (Book 19)",
  "Map": {
    "0": {
      "Id": 0,
      "Description": "You are a doughty sailor, a rover of the seven seas. You have many years' experience as a mariner, on great ships and small, on sailing-boats and huge warships. Neither howling storm nor dead calm disturbs you. Your trusty cutlass has slain many brigands and strange creatures of the deep. In port, you keep your listeners enthralled with your sea-stories. Some are true, some aren't... but nobody knows the difference except you.<br> You are five days out of Port Blacksand, first mate on the good ship <i>Sunfish</i>, when the pirate ship strikes. Swooping in on black sails like the wings of some giant, predatory sea-bird, it rams its prow across your decks. Beneath a leering, sharp-toothed figurehead is her name - the <i>Troll</i>. Dozens of ragged pirates swarm across the rails and attack.<br> The crew of the <i>Sunfish</i> fights bravely, but a peaceful merchant ship is no match for a pirate vessel. One by one you see your comrades fall. At last, only you are left. With your back to the mainmast, you lay about you with your trusty sabre, wounding one pirate after another. The pirates back away from you in fear. You drop your guard for a second - but too soon! From behind you, a black-bearded ruffian swings a huge belaying-pin. You see stars... then nothing.<br> When you awake, you are surprised to find yourself still alive. The <i>Sunfish</i>, a battered wreck, is burning nearby. Your comrades' bodies are gone - consigned, no doubt, to the deeps. You are on the deck of the <i>Troll</i>. Its sails snap in the breeze as the pirates head for their island lair.<br> You try to stand... and find you are tied to the mast. A coarse laugh comes from behind you. 'So... our hero is awake!' The speaker steps into view, and you see your captor - a bald, burly man in a once-elegant purple coat; he sweeps a mocking bow. 'Captain Bloodaxe, at your service! A pleasure to meet such a valiant fighter! I would offer you a place in my crew, but somehow you don't seem quite our type. Whatever shall we do with you?'<br> Several of the jeering pirates begin to offer suggestions: 'Keelhaul him! Run him up the mainmast and use him for a flag! Troll for sharks, with him as the bait!' But Captain Bloodaxe waves them to silence: 'No, my hearties! How savage of you! You should be ashamed of yourselves.' This one stood alone and defied us, slaying many of our comrades. Such a worthy fighter must be rewarded fittingly and will leave the ship unharmed!'<br> The pirates grumble, but the captain shouts them down, 'First, we must return your good sword to you.' He picks it up from the deck and replaces it in the scabbard at your belt.<br> 'Second, we must give you provisions for your trip.' He snaps his fingers, and a pirate brings a bag of black bread and salt beef - enough provisions for ten meals. He ties a heavy bag to your belt.<br> 'Third, we mush release these cruel bonds.' He draws his dirk and slashes the ropes that hold you to the mast. He yanks you to your feet, your hands still tied behind you. 'You'll forgive me if I don't untie your hands just yet, but you're a very dangerous foe!' Behind him, the pirates snicker.<br> 'And finally, we must give you your freedom!' He escorts you to the stern of the ship, where the lifeboats are tied. The pirate crew follows, grumbling. 'Unfortunately,' he adds, 'we can't spare a boat. So you'll just have to <i>swim</i> home!' With a powerful shove, he sends you over the railing. You hit the water with a tremendous splash. As Captain Bloodaxes's gifts drag you underwater, you hear the pirate crew laughing at the joke...",
      "Choices": [
        {
          "Description": "Start your adventure...",
          "Id": 1
        }
      ]
    },
    "1": {
      "Id": 1,
      "Description": "You sink slowly beneath the surface, holding your breath. Desperately, you try to free your hands, but the bonds are tight. Deeper and deeper you sink. Curious fish circle around you, and the world slowly turns sea-green. The ocean is shallow here, and you see that you are descending towards tall spires or coral. No, not coral, but a sunken city! You are drifting into the middle of a stately courtyard, now overgrown with weeds and coral. As your feet touch the bottom, you see lines of light blaze all around you. You gasp - losing most of your breath in a great bubble. The whole courtyard is a giant magical pentagram, and you are standing in its centre!<br> You have no time to appreciate the magic, however: you must swim back to the surface or drown! But the weight at your belt holds you down, and you cannot untie your hands. At last your strength fails, and you inhale the cold water. But you remain unharmed!<br> You realise that the magic of the pentagram has somehow protected you from drowning. You kick your way to a sharp coral spire and rub the rope against it until your hands are free. A strange feeling at your throat prompts you to look at your reflection in your shining sword. The spell has given you gills! You can breathe under water just like a Merman. You find that your leather bag of ten provisions is intact. Evidently the spell is also keeping the food from being ruined by the sea-water.",
      "Choices": [
        {
          "Description": "Remove the heavy belt and swim to the surface.",
          "Id": 63
        },
        {
          "Description": "Explore the sunken courtyard.",
          "Id": 173
        }
      ]
    },
    "2": {
      "Id": 2,
      "Description": "The underwater gardens seem to be laid out just like a formal garden on land. You swim through the heavy iron gate, noting that it is not at all rusty. Inside the gate, you see many beautiful specimens of seaweed, coral and water plants. Instead of birds, the 'trees' are filled with coloured fish. It is eerie, but peaceful. A few yards from the gate, the path splits in two.",
      "Choices": [
        {
          "Description": "Go to the left.",
          "id": 359
        },
        {
          "Description": "Go to the right.",
          "id": 174
        }
      ] 
    },
    "3": {
      "Id": 3,
      "Description": "You swim strongly up and away from the stadium, through the crack in the dome and over the city once more. Not far away, you see the patch of clean sand that you observed earlier. You can now see that a small object of some kind is in the middle of the sand.",
      "Choices": [
        {
          "Description": "Continue...",
          "Id": 196
        }
      ]
    },
    "4": {
      "Id": 4,
      "Description": "The king's eyes open even wider. 'Yes, since you ask, there is a great service you can do for our kingdom. In an upper room of our palace lies a fair princess, doomed to sleep until she be kissed by a hero. None of our nobles has been able to lift the spell. Will you try?",
      "Choices": [
        {
          "Description": "Agree to try.",
          "Id": 399
        },
        {
          "Description": "Decline the honour.",
          "Id": 284
        }
      ]
    },
    "5": {
      "Id": 5,
      "Description": "Her evil appearance chills your blood, but perhaps she can be helpful to you. Keeping your hand well away from your sword, you speak to her as courteously as you can. 'O wise woman, pray forgive my intrusion, but I am in need of help. I have brought you a valuable gift, and you would honour me by accepting it.' She thrusts out her hand greedily. What will you offer her?",
      "Choices": [
        {
          "Description": "A Black Pearl.",
          "Id": 127
        },
        {
          "Description": "A Toothfish.",
          "Id": 127
        },
        {
          "Description": "A magic sword.",
          "Id": 127
        },
        {
          "Description": "Attack her.",
          "Id": 254
        }
      ]
    },
    "6": {
      "Id": 6,
      "Description": "You swim down into the chasm. The light fails rapidly as you swim lower.",
      "Choices": [
      ] 
    },
    "196": {
      "Id": 196,
      "Description": "You swim closer, until you see a large area of clean white sand. Standing upright in the sand is a moss-covered human skull. As you approach, the water around the skull begins to shimmer and you hear a thin voice inside your head. What will you do?",
      "Choices": [
        {
          "Description": "Run away.",
          "Id": 10
        },
        {
          "Description": "Listen to the voice.",
          "Id": 321
        },
        {
          "Description": "Attack.",
          "Id": 26
        }
      ]
    }
  }
}